Revit 2026 API

# ExportColumnHeaders Enumeration

---

Options for exporting column headers in schedule view export.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ExportColumnHeaders
```
```vb
Public Enumeration ExportColumnHeaders
```
```cpp
public enum class ExportColumnHeaders
```
```fsharp
type ExportColumnHeaders
```

| Member name | Value | Description |
| --- | --- | --- |
| MultipleRows | 2 | Both column headers and grouped header cells are exported. |
| None | 0 | Do not export column headers. |
| OneRow | 1 | Export the column headers only. |

#### Reference

Autodesk.Revit.DB Namespace